day5/bbq/app/controllers/barbecues_controller.rb

  def index
    @barbecues = Barbecue.order(:date)
---
SELECT "barbecues".* FROM "barbecues"  ORDER BY "barbecues"."date" ASC

  def create
    bbq_params = params.require(:barbecue).permit(:title, :venue, :date)
    @bbq = Barbecue.new(bbq_params)

    unless @bbq.save
---
INSERT INTO "barbecues" ("title", "venue", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "algo"], ["venue", "algo"], ["date", "1233-02-21 00:00:00.000000"], ["created_at", "2016-05-13 08:22:09.759740"], ["updated_at", "2016-05-13 08:22:09.759740"]]