day5/bbq/app/controllers/api/barbecues_controller.rb

  def show
    barbecue = Barbecue.find_by(id: params[:id])
---
SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 1]]